In [1]:
#JOINING

In [2]:
#Joining is a convenient method for combining the columns of 2 
#potentially differently indexed dataframes into a single result 
#dataframe

In [3]:
#joining is same as merging but performed on indexes instead of keys

In [5]:
import pandas as pd

In [6]:
left=pd.DataFrame({"A":["A0","A1","A2"],"B":["B0","B1","B2"]},index=["k0","k1","k2"])

In [7]:
left

     A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2

In [8]:
right=pd.DataFrame({"C":["C0","C2","C3"],"D":["D0","D2","D3"]},index=["k0","k2","k3"])

In [9]:
right

     C   D
k0  C0  D0
k2  C2  D2
k3  C3  D3

In [10]:
left.join(right)

     A   B    C    D
k0  A0  B0   C0   D0
k1  A1  B1  NaN  NaN
k2  A2  B2   C2   D2

In [11]:
left.join(right,how="outer")

      A    B    C    D
k0   A0   B0   C0   D0
k1   A1   B1  NaN  NaN
k2   A2   B2   C2   D2
k3  NaN  NaN   C3   D3

In [12]:
left.join(right,how="left")

     A   B    C    D
k0  A0  B0   C0   D0
k1  A1  B1  NaN  NaN
k2  A2  B2   C2   D2

In [13]:
left.join(right,how="right")

      A    B   C   D
k0   A0   B0  C0  D0
k2   A2   B2  C2  D2
k3  NaN  NaN  C3  D3

In [ ]:
#that's all about joining with pandas